let songs = {
    '오르트구름': ['김민지', '김민규', '김병조', '홍지우', '박세영', '정재화'],
    '고백': ['안병규', '김민제', '김민규', '김민지', '박세영', '김혜민'],
    '좋아합니다': ['정재환', '김민규', '안우근','권수경', '김혜민'],
    '나비효과': ['김보균', '조정훈', '김재훈', '정재화', '이서영', '이선주'],
    '주저하는 연인들을 위해': ['이강희' ,'김병조', '김민제', '한지우', '이서영', '권수경', '손윤서'],
    'ur just horny': ['전민', '김민규', '김민제', '한지우', '안승환'],
    'what are you talking about': ['박시현', '홍윤표', '김수아', '안승환'],
    'viva청춘': ['안우근', '김수아', '권수경', '정재화'],
    'jenga': ['김보균', '박시현', '김민제', '한지우', '이서영', '안승환'],
    '아주 오래된 연인들': ['정재환', '김재훈', '홍지우', '박세영', '김수아', '이선주'],
    '심해': ['안병규', '김병조', '홍윤표', '김수아', '정재화'],
    'Dont look back in anger': ['전민', '김재훈', '조정훈', '정재화', '이서영', '김수아', '손윤서'],
};
let session = ['이강희','정재화', '안승환', '홍지우', '권수경', '전민', '김혜민', '안병규', '홍윤표', '이선주', '조정훈', '이서영', '박시현', '정재환', '손윤서', '김수아', '김병조',  '김보균', '김민제', '김민지', '김민규', '박세영', '안우근', '김재훈', '한지우'];


let unableTime = {
    '이강희' : ['0 8, 23 24', '0 8, 23 24', '0 8, 23 24', '0 8, 23 24', '0 8, 23 24', '0 8, 23 24', '0 8, 23 24'],
    '정재화' : ['0 8, 23 24','0 8, 23 24','0 8, 16 24','0 8, 16 24','0 8, 16 24','0 8, 23 24','0 8, 23 24'], //
    '안승환' : ['0 8, 15 17, 23 24','0 8, 23 24','0 8, 16 18, 23 24','0 17, 23 24','0 8, 15 18, 23 24','0 8, 23 24','0 8, 23 24'], //
    '홍지우' : ['0 24','0 21, 23 24','0 21, 23 24','0 13, 23 24','0 8, 23 24','0 8, 23 24','0 8, 23 24'],  //
    '권수경' : ['0 18, 23 24','0 18, 23 24','0 24','0 18, 23 24','0 18, 23 24','0 24','0 15, 23 24'],  //
    '전민' : ['0 8, 23 24','0 8, 23 24','0 8, 15 18, 23 24','0 8, 23 24','0 8, 23 24','0 8, 23 24','0 8, 23 24'],  //
    '김혜민' : ['0 12, 15 18, 23 24','0 18, 23 24','0 12, 15 17, 23 24','0 14, 15 17, 23 24','0 8, 23 24','0 8, 23 24','0 12, 23 24'],  //
    '안병규' : ['0 8, 12 15, 17 24','0 8, 13 24','0 8, 12 15, 17 24','0 8, 12 15, 23 24','0 24','0 8, 23 24','0 8, 19 24'],  //
    '홍윤표' : ['0 13, 23 24','0 13, 23 24','0 13, 23 24','0 13, 23 24','0 15, 23 24','0 8, 23 24','0 8, 23 24'],  //
    '이선주' : ['0 8, 23 24','0 8, 12 14, 15 17, 20 24','0 8, 12 17, 23 24','0 8, 13 15, 16 18, 20 24','0 8, 23 24','0 8, 23 24','0 8, 23 24'],  //
    '조정훈' : ['0 8, 9 12, 19 20, 23 24','0 8, 9 12, 13 15, 23 24','0 8, 9 18, 23 24','0 8, 9 14, 16 18, 23 24','0 15, 23 24','0 14, 23 24','0 8, 23 24'], //
    '이서영' : ['0 8, 15 17, 22 24','0 8, 23 24','0 8, 16 18, 23 24','0 8, 23 24','0 12, 23 24','0 8, 23 24','0 8, 23 24'], //
    '박시현' : ['0 15, 17 24','0 17, 23 24','0 18, 23 24','0 8, 23 24','0 8, 23 24','0 8, 23 24','0 8, 23 24'],  //
    '정재환' : ['0 8, 12 14, 15 17, 23 24','0 8, 9 12, 23 24','0 8, 13 15, 16 18, 23 24','0 8, 9 12, 13 18, 23 24','0 8, 14 18, 23 24','0 8, 23 24','0 8, 23 24'],//
    '손윤서' : ['0 8, 15 17, 23 24','0 8, 13 15, 16 18, 23 24','0 8, 16 18, 22 24','0 8, 12 14, 15 17, 22 24','0 8, 9 19, 23 24','0 8, 23 24','0 8, 23 24'],  //
    '김수아' : ['0 8, 12 14, 23 24','0 8, 16 18, 22 24','0 8, 9 11, 23 24','0 8, 10 12, 23 24','0 8, 12 15, 23 24','0 8, 23 24','0 24'],  //
    '김병조' : ['0 24','0 24','0 18, 23 24','0 18, 23 24','0 24','0 24','0 24'],  //
    '김보균' : ['0 8, 15 18, 20 24','0 8, 17 24','0 8, 15 18, 20 24','0 18, 23 24','0 24','0 24','0 8, 14 24'], //
    '김민제' : ['0 15, 23 24','0 15, 23 24','0 15, 23 24','0 15, 23 24','0 15, 23 24','0 8, 23 24','0 8, 23 24'],
    '김민지' : ['0 13, 18 24','0 24','0 16, 18 24','0 24','0 8, 13 24','0 24','0 24'], 
    '김민규' : ['0 24','0 15, 23 24','0 15, 23 24','0 15, 23 24','0 24','0 8, 23 24','0 8, 23 24'], 
    '박세영' : ['0 8, 13 15, 23 24','0 8, 23 24','0 15, 23 24','0 13, 23 24','0 13, 23 24','0 8, 23 24','0 8, 23 24'], 
    '안우근' : ['0 8, 23 24','0 24','0 12, 23 24','0 24','0 8, 23 24','0 8, 23 24','0 8, 23 24'], 
    '김재훈' : ['0 15, 23 24','0 24','0 24','0 8, 23 24','0 11, 23 24','0 8, 23 24','0 8, 23 24'], 
    '한지우' : ['0 8, 15 17, 23 24','0 8, 17 18, 23 24','0 8, 17 18, 23 24','0 8, 9 12, 13 17, 23 24','0 8, 23 24','0 8, 23 24','0 8, 23 24']  //
};
let songList = ['오르트구름',
    '고백',
    '좋아합니다',
    '나비효과',
    '주저하는 연인들을 위해',
    'ur just horny',
    'what are you talking about',
    'viva청춘',
    'jenga',
    '아주 오래된 연인들',
    '심해',
    'Dont look back in anger'
];

let ableTime = {
    '오르트구름' : new Array(7),
    '고백' : new Array(7),
    '좋아합니다' : new Array(7),
    '나비효과' : new Array(7),
    '주저하는 연인들을 위해' : new Array(7),
    'ur just horny' : new Array(7),
    'what are you talking about' : new Array(7),
    'viva청춘' : new Array(7),
    'jenga' : new Array(7),
    '아주 오래된 연인들' : new Array(7),
    '심해' : new Array(7),
    'Dont look back in anger': new Array(7),
};

function timeBinary(arr) {
    let time = new Array(24);
    time.fill(0);
    for(let i=0; i<arr.length; i++){
        let [startTime, endTime] = arr[i].split(' ');
        for(let j=startTime; j<endTime; j++) time[j] = 1;
    }
    return time;
}

for(let i=0; i<session.length; i++) {
    for(let j=0; j<7; j++){
        let timeArray = unableTime[session[i]][j].split(', ');
        let timeTableArray = timeBinary(timeArray);
        unableTime[session[i]][j] = timeTableArray.join('');
    }
}

for(let i=0; i<songList.length; i++) { 
    //console.log(songList[i]);
    for(let k=0; k<7; k++) {
        let dayTableString = '000000000000000000000000'.split('');
        for(let j=0; j<songs[songList[i]].length; j++) {
            let memberdayTableString = unableTime[songs[songList[i]][j]][k].split('');
            for(let l=0; l<24; l++) {
                if(memberdayTableString[l] == '1') dayTableString[l] = 1;
            }
            //console.log(songs[songList[i]][j] + dayTableString.join('') + '\n');
        }
        ableTime[songList[i]][k] = dayTableString.join('');
    }
}
//console.log(ableTime);

function outputStringMaker(str) {
    let arr = new Array(24);
    let flag = 0;
    let startTime, endTime;
    arr = str.split('').map(Number);
    for(let i=0; i<24; i++) {
        if(!arr[i]) {
            flag = 1;
            startTime = i;
            while(1){
                i++;
                if(arr[i]) {
                    endTime = i;
                    break;
                }
            }
            break;
        }
    }
    if(!flag) return 0;
    else return startTime + ' ~ ' + endTime;
}

for (let i=0; i<songList.length; i++) {
    console.log(songList[i] + ' 팀은 ');
    for (let j=0; j<7; j++) {
        let str = outputStringMaker(ableTime[songList[i]][j]);
        let output = '';
        switch(j) {
            case 0:
                output += '월요일 ';
                break;
            case 1:
                output += '화요일 ';
                break;
            case 2:
                output += '수요일 ';
                break;
            case 3:
                output += '목요일 ';
                break;
            case 4:
                output += '금요일 ';
                break;
            case 5:
                output += '토요일 ';  
                break;
            case 6:
                output += '일요일 ';  
                break;
        }
        if(!str) output += '연습이 불가능 합니다.';
        else output = output + str + '시 연습이 가능합니다.';
        console.log(output);
    }
    console.log('===================================');
}