let songs = {
    '등대' : ['안병규', '김민제', '한재민', '권수경', '한지우', '손윤서'],
    '하루종일' : ['이재준', '박건도', '이지호', '김수아', '한지우', '안승환'],
    'kiwi': ['박시현', '박건도', '이선주', '한재민', '한지우'],
    'the lights behind you' : ['박시현', '강재호', '김병조', '김혜민', '박건도'],
    'radio' : ['전민', '이지호', '김병조', '안승환', '안우근'],
    '불꽃놀이' : ['이선주', '김수현', '한지우', '조정훈', '강재호', '이서영', '전민', '이선주'],
    '그라데이션' : ['안병규', '이지호', '한재민', '김수아', '한지우', '김혜민'],
    '나비' : ['김수현', '강재호', '권수경', '이서영', '김병조', '안승환']
  };
  let session = ['강재호', '권수경', '김민제', '김병조', '김수아', '김수현', '김혜민', '박건도', '박시현', '손윤서', '안병규', '안승환', '안우근', '이서영', '이선주', '이재준', '이지호', '전민', '조정훈', '한재민', '한지우'];


  let unableTime = {
    '강재호' : ['0 10, 22 24', '0 10, 22 24' ,'0 15, 22 24' ,'0 19, 22 24' ,'0 15, 22 24' ,'0 10, 22 24' ,'0 10, 22 24'], //
    '권수경' : ['0 18, 22 24', '0 18, 22 24', '0 18, 22 24', '0 18, 22 24', '0 18, 22 24', '0 24' , '0 24'],
    '김민제' : ['0 17, 22, 24', '0 10, 17 24', '0 10, 22 24', '0 10, 17 24', '0 10, 22 24', '0 10, 17 24' ,'0 10, 22 24'],
    '김병조' : ['0 10, 22 24', '0 10, 18 24', '0 10, 22 24', '0 10, 18 24', '0 10, 22 24', '0 10, 12 17, 22 24', '0 24'],
    '김수아' : ['0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 24'],
    '김수현' : ['0 10, 22 24', '0 10, 22 24', '0 17, 22 24', '0 16, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24'],
    '김혜민' : ['0 10, 22 24', '0 10, 15 19, 22 24', '0 10, 22 24', '0 10, 15 19, 22 24', '0 24', '0 13, 22 24', '0 24'],
    '박건도' : ['0 18, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 18, 22 24', '0 10, 18 24', '0 10, 18 24'],
    '박시현' : ['0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24'],
    '손윤서' : ['0 18, 22 24', '0 18, 22 24', '0 18, 22 24' ,'0 18, 22 24', '0 18, 22 24', '0 24' , '0 18, 22 24'],
    '안병규' : ['0 10, 17 24', '0 10, 17 24', '0 10, 17 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24'],
    '안승환' : ['0 10, 13 16, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 13 16, 22 24', '0 10, 22 24', '0 16, 22 24'],
    '안우근' : ['0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 24', '0 10, 22 24'],
    '이서영' : ['0 13, 16 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 13, 16 24', '0 10, 22 24', '0 24'],
    '이선주' : ['0 10, 22 24', '0 10, 20 24', '0 10, 22 24', '0 10, 20 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24'],
    '이재준' : ['0 10, 22 24', '0 10, 18 24', '0 12, 16 18, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24'],
    '이지호' : ['0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 24', '0 24', '0 24'],
    '전민' : ['0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24'],
    '조정훈' : ['0 10, 14 16, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24', '0 24', '0 24'],
    '한재민' : ['0 10, 22 24', '0 10, 15 21, 22 24', '0 10, 22 24', '0 10, 15 21, 22 24', '0 10, 22 24', '0 10, 22 24', '0 10, 22 24'],
    '한지우' : ['0 10, 22 24', '0 10, 22 24' , '0 10, 22 24' , '0 10, 22 24' , '0 10, 22 24' ,'0 10, 22 24' , '0 10, 22 24']
  }
  let songList = ['등대',
  '하루종일',
  'kiwi',
  'the lights behind you',
  'radio',
  '불꽃놀이',
  '그라데이션',
  '나비'
];

let ableTime = {
    '등대': new Array(7),
    '하루종일': new Array(7),
    'kiwi': new Array(7),
    'the lights behind you': new Array(7),
    'radio': new Array(7),
    '불꽃놀이': new Array(7),
    '그라데이션': new Array(7),
    '나비': new Array(7)
  };

function timeBinary(arr) {
    let time = new Array(24);
    time.fill(0);
    for(let i=0; i<arr.length; i++){
        let [startTime, endTime] = arr[i].split(' ');
        for(let j=startTime; j<endTime; j++) time[j] = 1;
    }
    return time;
}

for(let i=0; i<session.length; i++) {
    for(let j=0; j<7; j++){
        let timeArray = unableTime[session[i]][j].split(', ');
        let timeTableArray = timeBinary(timeArray);
        unableTime[session[i]][j] = timeTableArray.join('');
    }
}

for(let i=0; i<songList.length; i++) { 
    //console.log(songList[i]);
    for(let k=0; k<7; k++) {
        let dayTableString = '000000000000000000000000'.split('');
        for(let j=0; j<songs[songList[i]].length; j++) {
            let memberdayTableString = unableTime[songs[songList[i]][j]][k].split('');
            for(let l=0; l<24; l++) {
                if(memberdayTableString[l] == '1') dayTableString[l] = 1;
            }
            //console.log(songs[songList[i]][j] + dayTableString.join('') + '\n');
        }
        ableTime[songList[i]][k] = dayTableString.join('');
    }
}
//console.log(ableTime);

function outputStringMaker(str) {
    let arr = new Array(24);
    let flag = 0;
    let startTime, endTime;
    arr = str.split('').map(Number);
    for(let i=0; i<24; i++) {
        if(!arr[i]) {
            flag = 1;
            startTime = i;
            while(1){
                i++;
                if(arr[i]) {
                    endTime = i;
                    break;
                }
            }
            break;
        }
    }
    if(!flag) return 0;
    else return startTime + ' ~ ' + endTime;
}

for (let i=0; i<songList.length; i++) {
    console.log(songList[i] + ' 팀은 ');
    for (let j=0; j<7; j++) {
        let str = outputStringMaker(ableTime[songList[i]][j]);
        let output = '';
        switch(j) {
            case 0:
                output += '월요일 ';
                break;
            case 1:
                output += '화요일 ';
                break;
            case 2:
                output += '수요일 ';
                break;
            case 3:
                output += '목요일 ';
                break;
            case 4:
                output += '금요일 ';
                break;
            case 5:
                output += '토요일 ';  
                break;
            case 6:
                output += '일요일 ';  
                break;
        }
        if(!str) output += '연습이 불가능 합니다.';
        else output = output + str + '시 연습이 가능합니다.';
        console.log(output);
    }
    console.log('===================================');
}